{
  "backend/main.mo": "Main backend actor implementing user profiles with PIN authentication, photo/video/document/memory management with role-based access control, storage limits, and blob storage integration.",
  "backend/migration.mo": "Migration module that adds a PIN field to existing UserProfile records, setting empty string as default for existing users during upgrade.",
  "feature_evidence.json": "Feature evidence report documenting four PIN-related features: PIN setup during account creation, PIN verification for protected sections, PIN reset/forgot flow, and PIN change in profile settings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including PIN components, authentication hooks, page guards, UI components with glass morphism design, and Hindi/English translation support.",
  "frontend/index.html": "HTML entry point for the AS19 Private Love Themed Memory Management App with mobile-optimized viewport settings and PWA capabilities.",
  "frontend/src/App.tsx": "Main React app component orchestrating authentication flow, profile setup, PIN setup, language synchronization, and navigation between sections with PIN session management.",
  "frontend/src/components/CreatedByBanner.tsx": "Banner component displaying 'Created By Azad' with gradient styling and decorative border.",
  "frontend/src/components/DocumentGallery.tsx": "Document gallery component with download, delete (admin-only), file type icons, size formatting, and bilingual support for Hindi/English.",
  "frontend/src/components/DocumentStorageMonitor.tsx": "Displays document storage usage metrics with a progress bar and warning alert when storage exceeds 80%, supporting bilingual display (English/Hindi).",
  "frontend/src/components/DocumentUpload.tsx": "Handles document file uploads with validation for file type (PDF, DOCX, TXT, Excel) and size (max 50MB), showing upload progress and bilingual toast notifications.",
  "frontend/src/components/GoogleDriveManager.tsx": "Empty file with no content.",
  "frontend/src/components/GoogleDrivePopup.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Empty file with no content.",
  "frontend/src/components/LanguageSelector.tsx": "Provides an elegant bilingual language selection screen with English and Hindi options, featuring animated decorative elements and a glass-effect card design.",
  "frontend/src/components/MemoriesStorageMonitor.tsx": "Displays memories storage usage metrics with a progress bar and warning alert when storage exceeds 80%, supporting bilingual display (English/Hindi).",
  "frontend/src/components/Navigation.tsx": "Renders the main navigation bar with section tabs (Media, Photos, Videos, Documents, Memories, Storage, Profile), user avatar, PIN lock status indicator, and logout button.",
  "frontend/src/components/PhotoGallery.tsx": "Displays a photo gallery with grid view, supports photo selection, deletion (admin only), individual and bulk downloads, and shows notifications for newly added photos.",
  "frontend/src/components/PhotoUpload.tsx": "Component for uploading multiple photos with file validation (type, 15MB size limit), preview generation, progress tracking, and batch upload using ExternalBlob with lossless quality. Includes admin-only access control and bilingual toast notifications.",
  "frontend/src/components/PinChangeForm.tsx": "Form component for changing user PIN with validation (4-6 digits), current PIN verification, confirmation matching, and session storage clearing on success. Displays error alerts and supports bilingual UI.",
  "frontend/src/components/PinReset.tsx": "PIN reset component requiring Internet Identity reauthentication before allowing users to set a new PIN. Includes validation, confirmation matching, and session storage clearing with back navigation support.",
  "frontend/src/components/PinSetup.tsx": "Initial PIN setup component for new users with 4-6 digit validation, confirmation matching, and animated UI with floating lock/shield icons. Saves PIN to user profile on successful setup.",
  "frontend/src/components/PinVerification.tsx": "PIN verification gate component that validates user-entered PIN against stored value, with option to navigate to PIN reset flow. Blocks access until correct PIN is entered and verified via session.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form component that allows users to enter their name and language preference, with error handling for authentication and backend connection issues.",
  "frontend/src/components/ScreenshotProtection.tsx": "Empty file with no content.",
  "frontend/src/components/StorageMonitor.tsx": "Displays photo storage usage metrics with a progress bar and warning alerts when storage approaches or reaches capacity limits.",
  "frontend/src/components/StoryEditor.tsx": "Form component for creating new memories with title and description fields, supporting both Hindi and English languages.",
  "frontend/src/components/StoryList.tsx": "Displays a list of memories with edit and delete functionality for admin users, including dialogs for updating and confirming deletions.",
  "frontend/src/components/SyncStatusIndicator.tsx": "Badge component showing real-time sync status (online/offline, syncing, error, success) with appropriate icons and Hindi labels.",
  "frontend/src/components/TotalStorageMonitor.tsx": "Dashboard card displaying total storage usage across photos, videos, documents, and memories with a progress bar and breakdown by category.",
  "frontend/src/components/VideoGallery.tsx": "Displays a grid of uploaded videos with thumbnails, play/preview functionality, download capability, and admin delete controls. Includes loading states, empty states, and confirmation dialogs for video deletion.",
  "frontend/src/components/VideoStorageMonitor.tsx": "Shows video storage usage metrics with a progress bar and warning alerts when storage exceeds 80% or reaches capacity. Displays used/total storage in MB/GB with Hindi labels.",
  "frontend/src/components/VideoUpload.tsx": "Handles video file uploads with progress tracking, automatic thumbnail generation from video frames, and 100MB file size validation. Uses ExternalBlob for chunked uploads with progress callbacks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, automatically recreating it when identity changes and invalidating dependent queries. Initializes access control for authenticated users.",
  "frontend/src/hooks/useAuth.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity state management, and session persistence. Includes status tracking for initialization, login progress, and error handling.",
  "frontend/src/hooks/useLanguage.ts": "Zustand store for managing language preference (Hindi/English) with persistence to localStorage. Tracks whether user has explicitly selected a language.",
  "frontend/src/hooks/usePinSession.ts": "Manages PIN verification session state using sessionStorage, providing verify/clear functions and loading states for PIN-protected admin features.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, photos, videos, documents, memories, and admin functions. Implements automatic refetching with configurable intervals and cache invalidation strategies.",
  "frontend/src/hooks/useSyncStatus.ts": "Custom React hook that monitors online/offline status and tracks React Query sync state, providing sync status including connectivity, syncing state, last sync time, and errors with Hindi error messages.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, mobile-responsive font sizing, and custom gradient utilities for a modern elegant design.",
  "frontend/src/lib/googleOAuth.ts": "Empty file for Google OAuth functionality (not yet implemented).",
  "frontend/src/lib/translations.ts": "TypeScript type definitions for translation keys covering all UI strings across welcome, language selection, navigation, profile, PIN system, dashboard, stories, storage, photos, documents, and other app features.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty file for admin dashboard page (not yet implemented).",
  "frontend/src/pages/Dashboard.tsx": "Empty file for main dashboard page (not yet implemented).",
  "frontend/src/pages/DocumentsPage.tsx": "Documents page component that requires PIN verification and conditionally renders DocumentUpload for admins and DocumentGallery for all authenticated users with decorative background.",
  "frontend/src/pages/MediaCenterPage.tsx": "Media center landing page displaying four category cards (Photos, Videos, Documents, Memories) with bilingual support, logout functionality, and admin-specific features.",
  "frontend/src/pages/MemoriesPage.tsx": "Memories page component that requires PIN verification and shows StoryEditor for admins, StoryList for all users, and a storage monitor with decorative background.",
  "frontend/src/pages/OAuthCallback.tsx": "Empty file for OAuth callback handling (not yet implemented).",
  "frontend/src/pages/PhotosPage.tsx": "Photos page component that requires PIN verification and renders PhotoUpload and PhotoGallery components, checking admin status to control upload permissions.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page with editable name, language preference, profile picture upload/removal, and PIN change form, supporting bilingual UI and toast notifications for user feedback.",
  "frontend/src/pages/StorageDashboardPage.tsx": "Displays a storage dashboard with total usage metrics and category breakdowns (Photos, Videos, Documents, Memories) using cards, progress bars, and alerts for storage warnings.",
  "frontend/src/pages/VideosPage.tsx": "Renders the Videos page with PIN verification, showing VideoUpload component for admins and VideoGallery for all authenticated users.",
  "frontend/src/pages/WelcomePage.tsx": "Landing page with Internet Identity login, displaying app branding, features, and a login button with loading states and bilingual support.",
  "frontend/src/types/frontend-types.ts": "Defines TypeScript interfaces for Documents and Memories metadata and request types, marked as frontend-only since backend implementation is pending.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, responsive container settings, extended spacing for safe areas, and custom keyframes for animations.",
  "project_state.json": "Project state document tracking authentication issues, security bug with cross-user storage access via email, and completed features for Memories and Documents sections."
}