{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Master Admin Dashboard with Analytics and Privacy Guardrails",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Create an Admin Dashboard page component accessible only to authenticated users with the Master Principal ID, displaying user count, canister inventory, storage insights, and cycle balance",
      "acceptanceCriteria": [
        "Dashboard page is protected by Internet Identity authentication",
        "Page verifies user principal matches Master Principal ID before rendering",
        "Unauthorized users see an access denied message",
        "Dashboard displays real-time analytics from backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "create",
          "description": "Create Admin Dashboard page component that verifies the current user's principal matches the Master Principal ID before rendering analytics. Display an access denied message for unauthorized users. The page will render metric cards for user count, canister inventory, storage insights table, and cycle balance. Use the authorization component to verify admin status via isCallerAdmin backend capability."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Design the Admin Dashboard with a dark-themed Command Center interface featuring visual counters for user count and canister inventory, progress bars showing storage distribution across categories, and cycle balance indicators",
      "acceptanceCriteria": [
        "Dashboard uses a dark theme with high contrast",
        "User and canister counts are displayed in prominent counter components",
        "Storage usage shows progress bars for total storage and per-category breakdown",
        "Cycle balance is displayed with visual indicators for health status",
        "Layout resembles a command center with organized metric cards"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminMetricCard.tsx",
          "operation": "create",
          "description": "Create a reusable metric card component for displaying admin analytics with dark theme styling, title, value, optional subtitle, and optional progress bar. Support both counter and gauge display modes with high-contrast colors suitable for a command center interface."
        },
        {
          "path": "frontend/src/components/AdminStorageTable.tsx",
          "operation": "create",
          "description": "Create a table component to display per-user storage metrics including token ID (Principal), total storage used, and category breakdown (photos, videos, documents, memories) with sizes formatted in appropriate units (MB, GB, TB). Include a summary row showing total aggregated storage across all users. Use dark theme styling consistent with the command center aesthetic."
        },
        {
          "path": "frontend/src/components/AdminCycleBalanceIndicator.tsx",
          "operation": "create",
          "description": "Create a cycle balance indicator component that displays the main canister's cycle balance in a human-readable format with visual health status indicators (healthy/warning/critical thresholds). Use progress bar or gauge visualization with color coding for sustainability status."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add dark mode support to the HTML root element or body class to ensure the admin dashboard dark theme is properly applied across the application when needed."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Create React Query hooks to fetch admin analytics data including user count, canister count, storage insights, and cycle balance from the backend",
      "acceptanceCriteria": [
        "Hooks use React Query for data fetching and caching",
        "Data refreshes at regular intervals to show real-time updates",
        "Error states are handled gracefully",
        "Loading states are displayed during data fetch"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for admin analytics: useGetUniqueUserProfileCount (fetches total user count), useGetVirtualCanisterCount (fetches canister inventory count), useGetAllUserStorageSummaries (fetches per-user storage metadata), and useGetMainCanisterCycleBalance (fetches cycle balance). Configure hooks with refetchInterval for real-time updates (e.g., 30 seconds), proper error handling, and loading states. Ensure hooks are only enabled when the user is authenticated and is an admin."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Display individual storage usage per user token in a table or list view on the Admin Dashboard, showing token ID, total storage used, and breakdown by category (photos, videos, documents, memories) in GB/TB format",
      "acceptanceCriteria": [
        "Table displays all user tokens with their storage metrics",
        "Storage sizes are formatted in appropriate units (MB, GB, TB)",
        "Category breakdown is visible for each token",
        "Total aggregated storage is prominently displayed at the top"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/formatUtils.ts",
          "operation": "create",
          "description": "Create utility functions for formatting storage sizes (bytes to MB/GB/TB with appropriate unit selection based on size), formatting principal IDs for display (truncated with ellipsis), and formatting cycle balances in human-readable format. These utilities will be used across admin dashboard components."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Integrate AdminStorageTable component into the dashboard layout, passing fetched storage data from useGetAllUserStorageSummaries hook. Display total aggregated storage prominently at the top using formatted values from formatUtils. Ensure proper loading and error states are handled."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add navigation to the Admin Dashboard from the main application navigation bar, visible only to users with the Master Principal ID",
      "acceptanceCriteria": [
        "Admin Dashboard link appears in the navigation bar only for the founder principal",
        "Link navigates to the admin dashboard route",
        "Regular users do not see the admin navigation option"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add a conditional Admin Dashboard navigation item that only renders when isCallerAdmin returns true. Position it after the Profile tab. Include an appropriate icon (use a shield or dashboard icon) and label. Wire the navigation item to route to the admin dashboard page. Use the authorization component's isCallerAdmin capability to control visibility."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add routing for the Admin Dashboard page at path '/admin'. Import and render AdminDashboard component when the route matches. Ensure the route is protected by authentication (user must be logged in). The page-level principal verification will be handled within AdminDashboard component itself."
        }
      ]
    }
  ]
}