{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add PIN-based folder access control with setup, verification, and recovery",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Create PIN setup screen during initial account creation with confirmation entry",
      "acceptanceCriteria": [
        "PIN setup appears immediately after profile setup for new users",
        "User must enter PIN twice to confirm",
        "Both entries must match before proceeding",
        "Clear visual feedback for PIN strength and match status"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PinSetup.tsx",
          "operation": "create",
          "description": "Create a PIN setup component that prompts new users to create a 4-6 digit PIN with confirmation entry. Include validation for PIN length, match verification between both entries, and visual feedback for strength and match status. Use translations from frontend/src/lib/translations.ts for all UI text. Show error messages when PINs don't match or don't meet requirements. Call saveCallerUserProfile with the PIN field after successful setup."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the PinSetup component into the authentication flow. Show PinSetup immediately after ProfileSetup for new users who don't have a PIN set in their profile. Use the userProfile state to determine if PIN setup is needed. Ensure PinSetup appears before granting access to the main application routes."
        },
        {
          "path": "frontend/src/lib/translations.ts",
          "operation": "modify",
          "description": "Add English and Hindi translation keys for PIN setup including: setup title, instructions, PIN input labels, confirm PIN label, PIN mismatch error, PIN length error, PIN strength feedback, and success message."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Implement PIN verification screen blocking access to protected folder sections",
      "acceptanceCriteria": [
        "PIN entry prompt appears when user attempts to access any folder section",
        "Folders remain locked until correct PIN is verified",
        "Invalid PIN shows error message and allows retry",
        "Successful PIN entry grants access to all folders for the session"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PinVerification.tsx",
          "operation": "create",
          "description": "Create a PIN verification component that prompts users to enter their PIN before accessing protected content. Include a numeric input field (4-6 digits), verification button, error message display for invalid PINs, and retry capability. Call the backend verifyPin method and handle success/failure responses. Use translations for all UI text including title, input label, verify button, error messages, and forgot PIN link."
        },
        {
          "path": "frontend/src/hooks/usePinSession.ts",
          "operation": "create",
          "description": "Create a custom hook to manage PIN session state using sessionStorage. Track whether the user has successfully verified their PIN in the current session. Provide methods to verify PIN (calling backend verifyPin), check verification status, and clear session on logout. Return isVerified state and verifyPin function."
        },
        {
          "path": "frontend/src/pages/PhotosPage.tsx",
          "operation": "modify",
          "description": "Add PIN verification guard before showing photo content. Use the usePinSession hook to check if PIN is verified. If not verified, render the PinVerification component instead of the photo gallery. After successful verification, show the existing PhotoUpload and PhotoGallery components."
        },
        {
          "path": "frontend/src/pages/VideosPage.tsx",
          "operation": "modify",
          "description": "Add PIN verification guard before showing video content. Use the usePinSession hook to check if PIN is verified. If not verified, render the PinVerification component instead of the video gallery. After successful verification, show the existing VideoUpload and VideoGallery components."
        },
        {
          "path": "frontend/src/pages/DocumentsPage.tsx",
          "operation": "modify",
          "description": "Add PIN verification guard before showing document content. Use the usePinSession hook to check if PIN is verified. If not verified, render the PinVerification component instead of the document gallery. After successful verification, show the existing DocumentUpload and DocumentGallery components."
        },
        {
          "path": "frontend/src/pages/MemoriesPage.tsx",
          "operation": "modify",
          "description": "Add PIN verification guard before showing memories content. Use the usePinSession hook to check if PIN is verified. If not verified, render the PinVerification component instead of the memories editor and list. After successful verification, show the existing StoryEditor and StoryList components."
        },
        {
          "path": "frontend/src/lib/translations.ts",
          "operation": "modify",
          "description": "Add English and Hindi translation keys for PIN verification including: verification title, PIN input label, verify button text, invalid PIN error, retry message, forgot PIN link text, and access granted message."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Create PIN reset/forgot flow with identity re-verification",
      "acceptanceCriteria": [
        "Forgot PIN link appears on PIN entry screen",
        "User must re-authenticate using their login method to reset PIN",
        "After re-authentication, user can set a new PIN",
        "Backend validates identity before allowing PIN reset"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PinReset.tsx",
          "operation": "create",
          "description": "Create a PIN reset component that guides users through re-authentication and setting a new PIN. Include explanation text about identity verification, a re-authentication button that triggers Internet Identity login, and a new PIN setup form (similar to PinSetup) that appears after successful re-authentication. Call saveCallerUserProfile to update the PIN field after verification. Use translations for all UI text."
        },
        {
          "path": "frontend/src/components/PinVerification.tsx",
          "operation": "modify",
          "description": "Add a 'Forgot PIN?' link that navigates to the PIN reset flow. Use a state or modal to show the PinReset component when the forgot link is clicked. Ensure the reset flow is accessible from the verification screen."
        },
        {
          "path": "frontend/src/lib/translations.ts",
          "operation": "modify",
          "description": "Add English and Hindi translation keys for PIN reset including: reset title, re-authentication instructions, re-authentication button text, new PIN setup instructions, reset success message, and reset error messages."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Add Change PIN option in Profile settings with current PIN verification",
      "acceptanceCriteria": [
        "Change PIN option appears in Profile settings",
        "User must enter current PIN before setting new PIN",
        "New PIN must be confirmed with double entry",
        "Success message confirms PIN change"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PinChangeForm.tsx",
          "operation": "create",
          "description": "Create a PIN change form component with three input fields: current PIN, new PIN, and confirm new PIN. Validate that current PIN is correct by calling verifyPin backend method, ensure new PIN meets requirements (4-6 digits), verify new PIN confirmation matches, and call the backend changePin method. Show success message after successful change and error messages for validation failures. Use translations for all UI text."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Add a 'Change PIN' section or button in the profile page that displays the PinChangeForm component. Position it below the profile picture and language preference sections. Use translations for the section title and instructions."
        },
        {
          "path": "frontend/src/lib/translations.ts",
          "operation": "modify",
          "description": "Add English and Hindi translation keys for PIN change including: change PIN title, current PIN label, new PIN label, confirm new PIN label, PIN change success message, current PIN incorrect error, new PIN validation errors, and PIN mismatch error."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add English and Hindi translations for all PIN-related UI text",
      "acceptanceCriteria": [
        "All PIN screens display text in user's selected language",
        "Translations include setup instructions, error messages, and success confirmations",
        "Forgot PIN flow fully translated",
        "Change PIN interface fully translated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/translations.ts",
          "operation": "modify",
          "description": "Ensure comprehensive English and Hindi translations are added for all PIN-related UI elements across setup, verification, reset, and change flows. Include translations for titles, instructions, labels, button text, error messages, success messages, validation feedback, and help text. Organize translations under a 'pin' namespace for clarity."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Implement session-based PIN authentication persisting across folder access",
      "acceptanceCriteria": [
        "PIN verification persists for the browser session",
        "Session expires on logout or browser close",
        "User must re-enter PIN after session expiration",
        "Clear visual indicator shows when folders are unlocked"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePinSession.ts",
          "operation": "modify",
          "description": "Ensure the PIN session hook uses sessionStorage (not localStorage) to persist verification state only for the current browser session. Implement automatic session clearing on logout by integrating with the useInternetIdentity hook's clear method. Add a visual state indicator (isUnlocked) that components can use to show lock/unlock status."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add a visual indicator in the navigation showing PIN unlock status. Display a lock icon when folders are locked and an unlock icon when PIN is verified. Use the usePinSession hook to check verification status. Position the indicator near the folder navigation items or in the header area."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Integrate PIN session clearing with the logout flow. When the user logs out via Internet Identity clear method, ensure the PIN session is also cleared by calling the appropriate method from usePinSession. This ensures the user must re-enter PIN after logging back in."
        },
        {
          "path": "frontend/src/lib/translations.ts",
          "operation": "modify",
          "description": "Add English and Hindi translation keys for session status indicators including: folders locked message, folders unlocked message, session expired message, and re-enter PIN prompt."
        }
      ]
    }
  ]
}